Revit 2027 API
SpatialElementTagOrientation Enumeration
 An enumerated type listing tag orientation options that are supported by SpatialElementTags.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SpatialElementTagOrientation
Public Enumeration SpatialElementTagOrientation
public enum class SpatialElementTagOrientation
type SpatialElementTagOrientation
Members
Member name | Value | Description
Horizontal | 0 |  The Orientation of tag is Horizontal.
Model | 2 |  The Orientation of tag is Model.
Vertical | 1 |  The Orientation of tag is Vertical.
See Also
Reference
Autodesk.Revit.DB Namespace